controllers/ProductController.php

SELECT * FROM `product` WHERE `id`='9'
---
    protected function findModel($id)
    {
        if (($model = Product::findOne(['id' => $id])) !== null) {