models/User.php

SELECT * FROM `user` WHERE `login`='root'
---
    public static function findByLogin($login){
        return self::find()->where(['login'=> $login])->one();